ciottisimone88/SH_Firmware/hand_firmware_micro.cydsn/Generated_Source/PSoC3/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "MOTOR_1A.h"
#include "MOTOR_1A_aliases.h"
#include "MOTOR_EN.h"
#include "MOTOR_EN_aliases.h"
#include "MOTOR_2A.h"
#include "MOTOR_2A_aliases.h"
#include "CLOCK_UART.h"
#include "ISR_RS485_RX.h"
#include "RS_485_EN.h"
#include "RS_485_EN_aliases.h"
#include "PWM_MOTORS.h"
#include "CLOCK_PWM.h"
#include "Signal_1_C.h"
#include "Signal_1_C_aliases.h"
#include "EMG_2.h"
#include "EMG_2_aliases.h"
#include "PACER_TIMER.h"
#include "UART_RS485.h"
#include "MOTOR_1B.h"
#include "MOTOR_1B_aliases.h"
#include "MOTOR_2B.h"
#include "MOTOR_2B_aliases.h"
#include "MOTOR_DIR.h"
#include "COUNTER_ENC.h"
#include "SHIFTREG_ENC_3.h"
#include "CLOCK_ENCODERS.h"
#include "SHIFTREG_ENC_2.h"
#include "EEPROM.h"
#include "USB_VDD.h"
#include "USB_VDD_aliases.h"
#include "FTDI_ENABLE.h"
#include "FTDI_ENABLE_aliases.h"
#include "Signal_1_B.h"
#include "Signal_1_B_aliases.h"
#include "ADC.h"
#include "BOARD_LED.h"
#include "BOARD_LED_aliases.h"
#include "Signal_1_A.h"
#include "Signal_1_A_aliases.h"
#include "RS485_CTS.h"
#include "Bootloadable.h"
#include "MOTOR_ON_OFF.h"
#include "FTDI_ENABLE_REG.h"
#include "EMG_1.h"
#include "EMG_1_aliases.h"
#include "CURRENT_SENSE_1.h"
#include "CURRENT_SENSE_1_aliases.h"
#include "RESET_FF.h"
#include "FF_STATUS.h"
#include "MY_TIMER.h"
#include "timer_clock.h"
#include "VOLTAGE_SENSE.h"
#include "VOLTAGE_SENSE_aliases.h"
#include "SHIFTREG_ENC_1.h"
#include "RESET_COUNTERS.h"
#include "ADC_STATUS.h"
#include "DMA_dma.h"
#include "ADC_SOC.h"
#include "WATCHDOG_CLK.h"
#include "ISR_WATCHDOG.h"
#include "WATCHDOG_COUNTER.h"
#include "WATCHDOG_ENABLER.h"
#include "WATCHDOG_REFRESH.h"
#include "LED_BLINK.h"
#include "LED_CTRL.h"
#include "LED_BLINK_EN.h"
#include "CLOCK_PWM_1.h"
#include "CYCLES_TIMER.h"
#include "counter_cyc_clk.h"
#include "ISR_CYCLES.h"
#include "ADC_AMux.h"
#include "ADC_Ext_CP_Clk.h"
#include "ADC_IRQ.h"
#include "ADC_theACLK.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "PSoC3_8051.h"
#include "cy_em_eeprom.h"

/*[]*/

